/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   lis.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: itakumi <itakumi@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/06/30 14:05:09 by itakumi           #+#    #+#             */
/*   Updated: 2025/06/30 16:27:59 by itakumi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"
#include "list.h"
#include <math.h>

// 構造体にlisかどうかを判別するフラグを追加したほうがいいのでは
// t_root	*lis(t_root *stack)
// {
// 	double	d = NAN;
// 	printf("%f\n", d);

// }
